Revit 2024 API
PartMakerMethodToDivideVolumes.GetSplitRefsOffsets Method
 Returns offsets for plane-defining splitters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IDictionary<ElementId, double> GetSplitRefsOffsets()
Visual Basic
Public Function GetSplitRefsOffsets As IDictionary(Of ElementId, Double)
Visual C++
public:
IDictionary<ElementId^, double>^ GetSplitRefsOffsets()
See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace